wef/00-enumerate.xml

<!--
Client(127.0.0.1:61232)->Server(127.0.0.1:5986):
POST /wsman/SubscriptionManager/WEC HTTP/1.1
Connection: Keep-Alive
Content-Type: application/soap+xml;charset=UTF-16
Authorization: http://schemas.dmtf.org/wbem/wsman/1/wsman/secprofile/https/mutual
User-Agent: Microsoft WinRM Client
Content-Length: 3216
Host: 10.0.2.2:15986
-->
<s:Envelope
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"
    xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd">
  <s:Header>
    <a:To>https://10.0.2.2:15986/wsman/SubscriptionManager/WEC</a:To>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/SubscriptionManager/Subscription</w:ResourceURI>
    <m:MachineID xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/machineid" s:mustUnderstand="false">dc.markkurossi.com</m:MachineID>
    <a:ReplyTo>
      <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
    <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
    <a:MessageID>uuid:D8B2F903-E1DF-478E-9BDF-EE5329A16529</a:MessageID>
    <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
    <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
    <p:SessionId s:mustUnderstand="false">uuid:E57EDCF0-11CE-4A3E-BCC8-ED3F2855B28D</p:SessionId>
    <p:OperationID s:mustUnderstand="false">uuid:956ED6AD-72EC-442C-8F05-F7BD23733DC3</p:OperationID>
    <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
    <w:OperationTimeout>PT60.000S</w:OperationTimeout>
  </s:Header>
  <s:Body>
    <n:Enumerate>
      <w:OptimizeEnumeration/>
      <w:MaxElements>32000</w:MaxElements>
    </n:Enumerate>
  </s:Body>
</s:Envelope>
